/***************************************************************************************************
 * Загрузка необходимых полифиллов для Angular.
 */

/**
 * Zone.js — это полифилл, который Angular использует для управления асинхронным выполнением кода.
 * Он обязателен для работы Angular.
 */
import 'zone.js'; // Included with Angular CLI.

/***************************************************************************************************
 * Дополнительные настройки:
 * Вы можете добавлять сюда дополнительные полифиллы, чтобы обеспечить поддержку старых браузеров.
 */